Model Name: SportySparrow
Configuration Settings:
checkpoint_dir: /Users/k/git/azero/_Data/SportySparrow/model_checkpoints
dataset_dir: /Users/k/git/azero/datasets
dirs: 
    base: _Data
    checkpoint_dir: model_checkpoints
    dataset_dir: datasets
    game_dir: games
game_dir: /Users/k/git/azero/_Data/SportySparrow/games
mock: False
model: 
    dtype: float32
    input_shape: [8, 8, 11]
    logging: 
        load_from_mlflow: False
        log_metrics_every: 1
        log_mlflow: False
        mlflow_model_version: 0
        save_local: True
        save_mlflow: False
        save_model_every: 1
    policy_head: 
        dense_layer: 
            activation: relu
            output_shape: [8, 8, 64]
        residual_layer: 
            batch_normalization: True
            filter_size: 1
            filter_stride: 1
            num_filters: 4
    residual_block: 
        activation: relu
        batch_normalization: True
        filter_size: 5
        filter_stride: 1
        layers: 2
        num_filters: 128
    resnet_depth: 7
    training: 
        batch_size: 64
        learning_rate: 0.1
    value_head: 
        dense_layer: 
            activation: tanh
            num_filters: 128
        residual_layer: 
            batch_normalization: True
            filter_size: 1
            filter_stride: 1
            num_filters: 2
model_name: SportySparrow
model_uri_format: models:/SportySparrow/{version}
name: SportySparrow
player: 
    exploration: 1
    heat: 1
    rollout_payoffs: 
        black: 
            black_wins: 1
            draw: 0
            draw_by_rep: 0
            draw_by_stale_mate: 0
            draw_by_two_wins: 0
            white_wins: -1
        white: 
            black_wins: -1
            draw: 0
            draw_by_rep: 0
            draw_by_stale_mate: 0
            draw_by_two_wins: 0
            white_wins: 1
stockfish: 
    enable: False
    search_depth: 10
    time_limit: 0.1

Model: "SportySparrow"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 8, 8, 11)     0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 8, 8, 128)    35328       input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 8, 8, 128)    512         conv2d_1[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 8, 8, 128)    0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 8, 8, 128)    409728      activation_1[0][0]               
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 8, 8, 128)    512         conv2d_2[0][0]                   
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 8, 8, 128)    0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 8, 8, 128)    409728      activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 8, 8, 128)    512         conv2d_3[0][0]                   
__________________________________________________________________________________________________
add_1 (Add)                     (None, 8, 8, 128)    0           batch_normalization_3[0][0]      
                                                                 activation_1[0][0]               
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 8, 8, 128)    0           add_1[0][0]                      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 8, 8, 128)    409728      activation_3[0][0]               
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 8, 8, 128)    512         conv2d_4[0][0]                   
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 8, 8, 128)    0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 8, 8, 128)    409728      activation_4[0][0]               
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 8, 8, 128)    512         conv2d_5[0][0]                   
__________________________________________________________________________________________________
add_2 (Add)                     (None, 8, 8, 128)    0           batch_normalization_5[0][0]      
                                                                 activation_3[0][0]               
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 8, 8, 128)    0           add_2[0][0]                      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 8, 8, 128)    409728      activation_5[0][0]               
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 8, 8, 128)    512         conv2d_6[0][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 8, 8, 128)    0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 8, 8, 128)    409728      activation_6[0][0]               
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 8, 8, 128)    512         conv2d_7[0][0]                   
__________________________________________________________________________________________________
add_3 (Add)                     (None, 8, 8, 128)    0           batch_normalization_7[0][0]      
                                                                 activation_5[0][0]               
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 8, 8, 128)    0           add_3[0][0]                      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 8, 8, 128)    409728      activation_7[0][0]               
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 8, 8, 128)    512         conv2d_8[0][0]                   
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 8, 8, 128)    0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 8, 8, 128)    409728      activation_8[0][0]               
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 8, 8, 128)    512         conv2d_9[0][0]                   
__________________________________________________________________________________________________
add_4 (Add)                     (None, 8, 8, 128)    0           batch_normalization_9[0][0]      
                                                                 activation_7[0][0]               
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 8, 8, 128)    0           add_4[0][0]                      
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 8, 8, 128)    409728      activation_9[0][0]               
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 8, 8, 128)    512         conv2d_10[0][0]                  
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 8, 8, 128)    0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 8, 8, 128)    409728      activation_10[0][0]              
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 8, 8, 128)    512         conv2d_11[0][0]                  
__________________________________________________________________________________________________
add_5 (Add)                     (None, 8, 8, 128)    0           batch_normalization_11[0][0]     
                                                                 activation_9[0][0]               
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 8, 8, 128)    0           add_5[0][0]                      
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 8, 8, 128)    409728      activation_11[0][0]              
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 8, 8, 128)    512         conv2d_12[0][0]                  
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 8, 8, 128)    0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 8, 8, 128)    409728      activation_12[0][0]              
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 8, 8, 128)    512         conv2d_13[0][0]                  
__________________________________________________________________________________________________
add_6 (Add)                     (None, 8, 8, 128)    0           batch_normalization_13[0][0]     
                                                                 activation_11[0][0]              
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 8, 8, 128)    0           add_6[0][0]                      
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 8, 8, 128)    409728      activation_13[0][0]              
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 8, 8, 128)    512         conv2d_14[0][0]                  
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 8, 8, 128)    0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 8, 8, 128)    409728      activation_14[0][0]              
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 8, 8, 128)    512         conv2d_15[0][0]                  
__________________________________________________________________________________________________
add_7 (Add)                     (None, 8, 8, 128)    0           batch_normalization_15[0][0]     
                                                                 activation_13[0][0]              
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 8, 8, 128)    0           add_7[0][0]                      
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 8, 8, 4)      516         activation_15[0][0]              
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 8, 8, 2)      258         activation_15[0][0]              
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 8, 8, 4)      16          conv2d_16[0][0]                  
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 8, 8, 2)      8           conv2d_17[0][0]                  
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 8, 8, 4)      0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 8, 8, 2)      0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
policy_flatten (Flatten)        (None, 256)          0           activation_16[0][0]              
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 128)          0           activation_17[0][0]              
__________________________________________________________________________________________________
policy_dense (Dense)            (None, 4096)         1052672     policy_flatten[0][0]             
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 128)          16512       flatten_1[0][0]                  
__________________________________________________________________________________________________
policy_head (Reshape)           (None, 8, 8, 64)     0           policy_dense[0][0]               
__________________________________________________________________________________________________
value_head (Dense)              (None, 1)            129         dense_1[0][0]                    
==================================================================================================
Total params: 6,849,311
Trainable params: 6,845,459
Non-trainable params: 3,852